roam/20210418224148-a_lean_design_thinking_methodology_ldtm_for_machine_learning_and_modern_data_projects_paper_summary.tex
% Created 2021-04-18 Sun 23:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{DINH DUY KHA - 2019712308}
\date{}
\title{A Lean Design Thinking Methodology (LDTM) for Machine Learning and  Modern Data Projects - Paper Summary}
\hypersetup{
 pdfauthor={DINH DUY KHA - 2019712308},
 pdftitle={A Lean Design Thinking Methodology (LDTM) for Machine Learning and  Modern Data Projects - Paper Summary},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

In this paper, the authors propose \textbf{Lean Design Thinking Methodology} (LDTM), a software development methodology that combines the strength of CRISP-DM with Design Thinking and Lean Startup methodologies. LDTM helps speed up the development process while also encure that the solution meet the requirements by engaging with the customer frequently.

As an overview, LDTM works by combining three development methodologies: \textbf{Design Thinking}, \textbf{Lean Startup} and \textbf{CRISP-DM}.  The Design thinking principle is that the customer must be understood first before building the solution. In LDTM,  the ``Empathize'', ``Define'' and ``Ideate'' phases of Design Thinking is utilized. Lean Startup is a proposed methodology for running a start-up, which states that the minimum set of feature that satisfy early users should be developed first. Finally, CRISP-DM is an open standard that contains a complete blueprint for data mining projects containing six phases.

The resulting methodology is divided into three stages: \textbf{Business, Data and Product}, which is further divided into seven steps. The Bussiness stage is where the developers identify problems and propose the solutions. In Data stage, understanding and preparation of data is performed. Finally, in the Product stage, the solution is iterated through many version with the feedback of the customers.
The seven steps of LDTM are:
\begin{enumerate}
\item \textbf{Work Discovery}: The developers research about their customers and the requirements, then define the problem, objective and requirements for the project.
\item \textbf{Analytical Approach}: The developer identify the appropriate method that satisfy the requirements identified in the previous step.
\item \textbf{Data Resources}: The developers collect resources and data relavant to the target problem.
\item \textbf{Data Preparation}: Data is preprocessed into the final dataset used in the product.
\item \textbf{Build MVP}: The \textbf{Minimum Viable Product} (MVP) is built so that it could be quickly tested by users.
\item \textbf{Measure Value}: The developers then collect feedbacks from users so that the solution value is measured accurately.
\item \textbf{Learn \& Update}: Finally, the developers update the product accordingly from users' feedbacks.
\end{enumerate}



One weakness of proposed methodology is that it does not cover when to stop the development process. Engaging with the customer could be one solution to the problem. Another weakness of this paper is that there is no evaluation of LDTM, which makes its validity questionable.
\end{document}
